_posts/2020-06-08-go位运算.html
<div id="outline-container-orgd77f256" class="outline-2">
  <h2 id="orgd77f256"><code>&amp;</code> 位与</h2>
  <div class="outline-text-2" id="text-orgd77f256"></div>
  <div id="outline-container-org0525f6e" class="outline-3">
    <h3 id="org0525f6e">给定2个操作数a,b 当且仅当 a=b=1 时结果为1 否则为0</h3>
  </div>
  <div id="outline-container-orgffa8533" class="outline-3">
    <h3 id="orgffa8533">可用于将整数的指定位清零</h3>
    <div class="outline-text-3" id="text-orgffa8533">
      <div class="org-src-container">
        <pre
          class="src src-go"
        ><span style="color: #51afef;">func</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">x</span> <span style="color: #ECBE7B;">uint8</span> = 0xAC <span style="color: #5B6268;">// </span><span style="color: #5B6268;">x=10101100</span>
    x &amp;= 0xF0 <span style="color: #5B6268;">// </span><span style="color: #5B6268;">x= 10100000</span>
<span style="color: #51afef;">}</span>
</pre>
      </div>
    </div>
  </div>
  <div id="outline-container-org0b2033c" class="outline-3">
    <h3 id="org0b2033c">
      通过
      <code>&amp;</code>
      判断一个数为奇数(<code>odd</code>)还是偶数(<code>even</code>)
    </h3>
    <div class="outline-text-3" id="text-org0b2033c"></div>
    <div id="outline-container-org97f990f" class="outline-4">
      <h4 id="org97f990f">
        将数字和值1做 <code>&amp;</code> 如果结果是1,就说明原来的数字是奇数
      </h4>
    </div>
  </div>
</div>
<div id="outline-container-org8ba938e" class="outline-2">
  <h2 id="org8ba938e"><code>|</code> 位或</h2>
  <div class="outline-text-2" id="text-org8ba938e"></div>
  <div id="outline-container-org9da8c12" class="outline-3">
    <h3 id="org9da8c12">
      给定两个操作数 a,b 当且仅当a 和b都为0时结果为0 否则为 1
    </h3>
  </div>
  <div id="outline-container-orgcd645cd" class="outline-3">
    <h3 id="orgcd645cd">可以将一个整数中指定位置为1</h3>
  </div>
  <div id="outline-container-org3df7f83" class="outline-3">
    <h3 id="org3df7f83">对一个数字使用掩码技术</h3>
  </div>
  <div id="outline-container-orgaca1d70" class="outline-3">
    <h3 id="orgaca1d70">使用位作为配置信息如 linux的权限 1,2,4</h3>
  </div>
</div>

<div id="outline-container-org3a2567f" class="outline-2">
  <h2 id="org3a2567f"><code>^</code> 操作符</h2>
  <div class="outline-text-2" id="text-org3a2567f"></div>
  <div id="outline-container-org0155172" class="outline-3">
    <h3 id="org0155172">
      给定两个操作数 a,b 当且仅当 a!=b时 结果返回1 否则返回0
    </h3>
  </div>
  <div id="outline-container-org9a034ee" class="outline-3">
    <h3 id="org9a034ee">
      可以用来切换指定位上的值(数字进行翻转 0变为1 1变为0)
    </h3>
    <div class="outline-text-3" id="text-org9a034ee">
      <div class="org-src-container">
        <pre
          class="src src-go"
        > <span style="color: #51afef;">func</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">uint16</span> = 0xCEFF
    a ^= 0xFF00 <span style="color: #5B6268;">// </span><span style="color: #5B6268;">same a = a ^ 0xFF00</span>
<span style="color: #51afef;">}</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">a = 0xCEFF   (11001110 11111111)</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">a ^=0xFF00   (00110001 11111111)</span>
</pre>
      </div>
    </div>
  </div>

  <div id="outline-container-orgaf640c7" class="outline-3">
    <h3 id="orgaf640c7">
      比较两个数字正负号是否相同 如果
      <code>(a ^ b) &gt;= 0</code> 那么a和b同号,如果
      <code>(a ^ b) &lt; 0</code> 那么a和b异号
    </h3>
  </div>
  <div id="outline-container-org73d7564" class="outline-3">
    <h3 id="org73d7564">
      使用 <code>^</code> 作为位非操作 go中
      <code>^x=1^x</code> 将会反转x的位,可以通过 <code>^a</code> 来计算变量
      <code>a</code> 的补码
    </h3>
  </div>
</div>

<div id="outline-container-orgfef1da3" class="outline-2">
  <h2 id="orgfef1da3"><code>&amp;^</code> 运算符</h2>
  <div class="outline-text-2" id="text-orgfef1da3"></div>
  <div id="outline-container-org6499676" class="outline-3">
    <h3 id="org6499676">
      <code>&amp;^</code> 运算符叫做 <code>AND NOT</code> 。它是一个 使用
      <code>AND</code> 后，再使用 <code>NOT</code> 操作的简写
    </h3>
    <div class="outline-text-3" id="text-org6499676">
      <pre class="example">
Given operands a,b
AND_NOT(a, b) = AND(a, NOT(b))
// 给定两个操作数 a,b
// 当 a=NOT(b)=1 时，操作 AND_NOT(a, b) 返回 1。
// 否则返回 0。
</pre
      >
    </div>
  </div>
  <div id="outline-container-org50adee9" class="outline-3">
    <h3 id="org50adee9">如果第二个操作符返回1 那么该位将会清零</h3>
    <div class="outline-text-3" id="text-org50adee9">
      <div class="org-src-container">
        <pre class="src src-example">
AND_NOT(a, 1) = 0; clears a
AND_NOT(a, 0) = a;
</pre
        >
      </div>
    </div>
  </div>
</div>

<div id="outline-container-org30a8563" class="outline-2">
  <h2 id="org30a8563"><code>&lt;&lt;</code> 和 <code>&gt;&gt;</code> 运算符</h2>
  <div class="outline-text-2" id="text-org30a8563"></div>
  <div id="outline-container-orgd3a6cc4" class="outline-3">
    <h3 id="orgd3a6cc4">用来代表左移或者右移运算</h3>
    <div class="outline-text-3" id="text-orgd3a6cc4">
      <div class="note">
        <p>
          Given integer operands a and n, a &lt;&lt; n; 将 a 中的所有位向左偏移
          n 次 a &gt;&gt; n; 将 a 中的所有位向右偏移 n 次
        </p>
      </div>

      <div class="org-src-container">
        <pre
          class="src src-go"
        ><span style="color: #51afef;">func</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">int8</span> = 3
    fmt.<span style="color: #c678dd;">Printf</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"%08b\n"</span>, a<span style="color: #c678dd;">)</span>
    fmt.<span style="color: #c678dd;">Printf</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"%08b\n"</span>, a&lt;&lt;1<span style="color: #c678dd;">)</span>
    fmt.<span style="color: #c678dd;">Printf</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"%08b\n"</span>, a&lt;&lt;2<span style="color: #c678dd;">)</span>
    fmt.<span style="color: #c678dd;">Printf</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"%08b\n"</span>, a&lt;&lt;3<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">}</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">prints:</span>
<span style="color: #5B6268;">//</span><span style="color: #5B6268;">00000011</span>
<span style="color: #5B6268;">//</span><span style="color: #5B6268;">00000110</span>
<span style="color: #5B6268;">//</span><span style="color: #5B6268;">00001100</span>
<span style="color: #5B6268;">//</span><span style="color: #5B6268;">00011000</span>
</pre>
      </div>
    </div>
  </div>
  <div id="outline-container-org2ef4774" class="outline-3">
    <h3 id="org2ef4774">每次的位移都是乘或者除2次幂</h3>
  </div>
</div>
